modules/dfp_appengine/src/test/java/com/google/api/ads/dfp/jaxws/testing/test_request_oauth2.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header>
    <ns1:RequestHeader xmlns:ns1="https://www.google.com/apis/ads/publisher/#API_VERSION#">
      <ns1:networkCode xmlns:ns1="https://www.google.com/apis/ads/publisher/#API_VERSION#">TEST_NETWORK_CODE</ns1:networkCode>
      <ns1:applicationName xmlns:ns1="https://www.google.com/apis/ads/publisher/#API_VERSION#">TEST_APP (DfpApi-Java, Dfp-AppEngine/3.12.0, Common-Java/3.12.0, JAX-WS/Unknown, Java/#JAVA_VERSION#, maven)</ns1:applicationName>
    </ns1:RequestHeader>
  </S:Header>
  <S:Body>
    <createCompanies xmlns="https://www.google.com/apis/ads/publisher/#API_VERSION#">
      <companies></companies>
    </createCompanies>
  </S:Body>
</S:Envelope>